

lincensList = {'داشبورد':['گزیده'],
                'اطلاعات پایه':['کاربران','مشاوران','تلفیق مشاوران','مدیریت شعب','بیمه گر','تنظیمات پیامک','کارمزد استاندارد (آیین نامه)'],
                'اطلاعات حقوق و دستمزد':['ساعات کارکرد قانونی','مرخصی','گروه های حقوق و دستمزد','حداقل حقوق','کارمزد مشاوران','جدول مالیات'],
                'مشتریان':['مدیریت مشتریان گروهی','مدیریت مشتریان دستی','گزارش پیامک تمدید','ارسال پیامک'],
                'مدیریت صدور غیرزندگی':['افزودن فایل صدور','افزودن دستی صدور','تخصیص مشاور صدور'],
                'مدیریت صدور زندگی':['افزودن فایل صدور','افزودن دستی صدور','تخصیص مشاور صدور','الحاقیه زندگی'],
                'مدیریت کارمزد':['افزودن کارمزدها','تخصیص مشاوران','بدون کارمزد'],
                'مدیریت حقوق و دستمزد':['عملکرد ماهانه شعب','کارکرد پرسنل','سایر مزایا (غیرنقدی)'],
                'گزارش حقوق و دستمزد':['ماهانه خلاصه','ماهانه کلی'],
                'گزارشات مشاوران':['پرفراژ','پیشبینی کارمزد های آتی غیرزندگی','پیشبینی کارمزد های آتی زندگی'],
                'گزارشات مشتریان':['مانده حساب مشتریان'],
                'مدیریت تمدید':['وضعیت بیمه نامه های زندگی'],
                'گزارشات مدیریتی':['مقایسه کارمزد (غیرزندگی)','گزارش فروش','رتبه بندی مشتریان کارمزد','رتبه بندی مشتریان صدور','سررسیدنامه تمدید غیرزندگی','سررسیدنامه تمدید زندگی','سررسیدنامه سالانه زندگی','نتایج تمدید غیرزندگی','گزارش بازدهی']
                }


lincensListCounsoltant ={
            'گزارشات مشاوران':['پرفراژ','پیشبینی کارمزد های آتی'],
            'گزارشات مدیریتی':['مقایسه کارمزد (غیرزندگی)','رتبه بندی مشتریان کارمزد','سرسیدنامه تمدید']
            }

def FnclincensListCounsoltant(subPhone):
    allwo = {'type':{'name':'consultant','subPhone':subPhone}}
    for i in lincensList.keys():
        for j in lincensList[i]:
            if i not in lincensListCounsoltant.keys():
                allwo[str(i)+ ' - '+str(j)] = False
            else:
                allwo[str(i)+ ' - '+str(j)] = True
    return allwo


def FnclincensList(allwo):
    for i in lincensList.keys():
        for j in lincensList[i]:

            if str(i)+ ' - '+str(j) not in allwo:
                allwo[str(i)+ ' - '+str(j)] = False
    return allwo