import sms




#smsid = sms.SendSms('09011010959','test Deliver')
#print(smsid)

deliver = sms.CheckDeliver(458450966)
print(deliver)
{'اطلاعات پایه - کاربران': True, 'اطلاعات پایه - مشاوران': True, 'اطلاعات پایه - مدیریت شعب': True, 'اطلاعات پایه - بیمه گر': True, 'اطلاعات پایه - کارمزد استاندارد (آیین نامه)': True, 'اطلاعات حقوق و دستمزد - گروه های حقوق و دستمزد': True, 'اطلاعات حقوق و دستمزد - حداقل حقوق': True, 'اطلاعات حقوق و دستمزد - کارمزد مشاوران': True, 'اطلاعات حقوق و دستمزد - جدول مالیات': True, 'مدیریت کارمزد - افزودن کارمزدها': True, 'مدیریت کارمزد - تخصیص مشاوران': True, 'مدیریت حقوق و دستمزد - عملکرد ماهانه شعب': True, 'مدیریت حقوق و دستمزد - کارکرد پرسنل': True, 'مدیریت حقوق و دستمزد - سایر مزایا (غیرنقدی)': True, 'گزارش حقوق و دستمزد - ماهانه خلاصه': True, 'گزارش حقوق و دستمزد - ماهانه کلی': True, 'گزارشات مشاوران - پرفراژ': True, 'گزارشات مدیریتی - مقایسه کارمزد (غیرزندگی)': True, 'level': 'همه مشاوران', 'گزارشات مشاوران - پیشبینی کارمزد های آتی': True, 'name': 'معین دهقان', 'اطلاعات پایه - تلفیق مشاوران': True, 'داشبورد - گزیده': True, 'مشتریان - مدیریت مشتریان گروهی': True, 'مشتریان - مدیریت مشتریان دستی': True, 'گزارشات مدیریتی - گزارش فروش': True, 'گزارشات مدیریتی - رتبه بندی مشتریان کارمزد': True, 'اطلاعات حقوق و دستمزد - ساعات کارکرد قانونی': True, 'اطلاعات حقوق و دستمزد - مرخصی': True, 'مدیریت صدور غیرزندگی - افزودن فایل صدور': True, 'مدیریت صدور غیرزندگی - افزودن دستی صدور': True, 'مدیریت صدور غیرزندگی - تخصیص مشاور صدور': True, 'مدیریت صدور زندگی - افزودن فایل صدور': True, 'مدیریت صدور زندگی - افزودن دستی صدور': True, 'مدیریت صدور زندگی - تخصیص مشاور صدور': True, 'گزارشات مدیریتی - رتبه بندی مشتریان صدور': True, 'گزارشات مدیریتی - سرسیدنامه تمدید غیرزندگی': True, 'گزارشات مدیریتی - سرسیدنامه تمدید زندگی': True, 'مدیریت صدور زندگی - الحاقیه زندگی': True, 'گزارشات مدیریتی - نتایج تمدید غیرزندگی': True, 'phone': '09011010958', 'all': False}